app/views/pantries/show.html.erb

SELECT "available_ingredients".* FROM "available_ingredients" WHERE "available_ingredients"."pantry_id" = ?  [["pantry_id", 1]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
  </tr>
<%@pantry.available_ingredients.each do |ing|%>
    <tr>
      <td><%=Ingredient.find(ing.ingredient_id).name%></td>

SELECT "recipes".* FROM "recipes"
---
<br><br>
<%Recipe.all.each do |rec|%>