app/controllers/application_controller.rb

  def current_user
    if session[:user_id].present?
      user = User.find_by(id: session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]