app/controllers/available_ingredients_controller.rb

  def create
    @ingredients = Ingredient.all
    @available = AvailableIngredient.new(available_params)
    if @available.save
---
INSERT INTO "available_ingredients" ("pantry_id", "ingredient_id", "unit", "quantity") VALUES (?, ?, ?, ?)  [["pantry_id", 1], ["ingredient_id", 12], ["unit", "Gallon"], ["quantity", 1]]