app/controllers/ingredients_controller.rb

  def create
    @ingredient = Ingredient.new(ingredient_params)
    if @ingredient.save
---
INSERT INTO "ingredients" ("name", "wet", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Tomato"], ["wet", 0], ["created_at", "2019-07-09 17:23:17.730648"], ["updated_at", "2019-07-09 17:23:17.730648"]]