app/controllers/pantries_controller.rb

  def edit
    @pantry = Pantry.find_by(id: params[:id])
---
SELECT  "pantries".* FROM "pantries" WHERE "pantries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @pantry = Pantry.new(pantry_params)
    @pantry.user_id = current_user.id
    if @pantry.save
---
INSERT INTO "pantries" ("location", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["location", "home"], ["user_id", 1], ["created_at", "2019-07-09 17:08:19.532588"], ["updated_at", "2019-07-09 17:08:19.532588"]]

  def show
    @pantry = Pantry.find_by(id: params[:id])
---
SELECT  "pantries".* FROM "pantries" WHERE "pantries"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]