app/controllers/recipes_controller.rb

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "ingredients".* FROM "ingredients" ORDER BY "ingredients"."name" ASC
---
  def edit
    @recipe = Recipe.find_by(id: params[:id])
    @ingredients = Ingredient.all.order(:name)

INSERT INTO "recipes" ("instructions", "created_at", "updated_at", "name") VALUES (?, ?, ?, ?)
---
  def create
    @recipe = Recipe.new(recipe_params)
    if @recipe.save

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @recipe = Recipe.find_by(id: params[:id])