app/controllers/required_ingredients_controller.rb

  def create
    @ingredients = Ingredient.all
    @required = RequiredIngredient.new(available_params)
    if @required.save
---
INSERT INTO "required_ingredients" ("ingredient_id", "recipe_id", "quantity", "unit") VALUES (?, ?, ?, ?)  [["ingredient_id", 37], ["recipe_id", 1], ["quantity", 1], ["unit", "Other"]]