app/controllers/sessions_controller.rb

  def create
    if auth_hash = request.env["omniauth.auth"]
      if user = User.find_by(email: auth_hash["info"]["email"])
        session[:user_id] = user.id
        redirect_to user_path(user)
      else
        user = User.new(email: auth_hash['info']['email'], password: SecureRandom.hex, name: auth_hash['info']['name'])
        if user.save
          session[:user_id] = user.id
          redirect_to user_path(user)
        else
          raise users.errors.full_messages.inspect
        end
      end
    else
      user = User.find_by(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "kyle@kyle.com"], ["LIMIT", 1]]