app/controllers/users_controller.rb

  def create
    if params[:user][:password] == params[:user][:password_confirmation]
      @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("email", "name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def show
    @user = User.find_by(id: session[:user_id])
    if @user.pantries.empty?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "pantries".* FROM "pantries" WHERE "pantries"."user_id" = ?  [["user_id", 1]]
SELECT  1 AS one FROM "pantries" WHERE "pantries"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]